# Cursor Extensions Installed
# Generated on Mon Nov  3 12:24:43 CET 2025
# To install: Open Extensions panel (Cmd+Shift+X) and search for each extension

adelphes.android-dev-ext
anysphere.cursorpyright
anysphere.pyright
be5invis.vscode-icontheme-nomo-dark
compassak.intellij-idea-new-ui
dhruv.maven-dependency-explorer
eamodio.gitlens
equinusocio.vsc-material-theme-icons
extensions.json
foxundermoon.shell-format
fwcd.kotlin
github.vscode-github-actions
golang.go
hashicorp.terraform
jeff-hykin.better-shellscript-syntax
mathiasfrohlich.kotlin
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
ms-vscode.powershell
niccolomineo.default-dark-plus-intellij
pkief.material-icon-theme
rafaelrenanpacheco.darcula-theme
redhat.fabric8-analytics
redhat.java
redhat.vscode-microprofile
redhat.vscode-quarkus
redhat.vscode-yaml
sonarsource.sonarlint_ondemand-analyzers
sonarsource.sonarlint-vscode
sumneko.lua
theholycoder.swagger-tools
tobiasalthoff.atom-material-theme
tomoki1207.pdf
trinm1709.dracula-theme-from-intellij
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscode-icons-team.vscode-icons
